// •	Какое будет выведено значение: let x = 5; alert( x++ ); ? // вернёт 5, так постфиксная система. сначала элемент, потом увел. на 1.

// •	Чему равно такое выражение: [ ] + false - null + true ? //Ответ будет NaN

// •	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ? // Ответ 2

// •	Чему равна сумма [ ] + 1 + 2? // '12'

// •	Что выведет этот код: alert( "1"[0] )? // 1

// •	Чему равно 2 && 1 && null && 0 && undefined ? //Выражение &&(и) всегда запинается на лжи, а ||(или) на правде. Ответ null

// •	Есть ли разница между выражениями? !!( a && b ) и (a && b)? //Нет не равны. Так как первый будет boolean из-за !!

// •	Что выведет этот код: alert( null || 2 && 3 || 4 ); ? // Ответ 3. Так по приоритету сначала знаков && вып. раньше чем ||
// между 2 и 3, вернётся правда 3(так как в и выбереться большее), после сравниться null или 3, а так как или запинается на лжи, то
// будет 3, а между 3 или 4. В или уже запнулся на 3. Поэтому вернёт 3.

// •	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? // Нет. Ответ false. Так эти переменные просто как ящики для хранения.

// •	Что выведет этот код: alert( +"Infinity" ); ? // Выведет просто infinity, а если посмотреть тип - то число

// •	Верно ли сравнение: "Ёжик" > "яблоко"? // false

// •	Чему равно 0 || "" || 2 || undefined || true || falsе ? // Ответ 2
